adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.h
/* ========================================= Start of section using anonymous unions ========================================= */

#include "compiler_abstraction.h"

#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Unsupported compiler type
#endif

/* =========================================================================================================================== */
/* ================                                  Peripheral Address Map                                  ================ */
/* =========================================================================================================================== */

#define NRF_SYSCTRL_OICR_S_BASE           0x2F840000UL
#define NRF_SYSCTRL_L2CACHEDATA_S_BASE    0x3F640000UL
#define NRF_SYSCTRL_L2CACHEINFO_S_BASE    0x3F680000UL
#define NRF_SYSCTRL_SHA3CORE_S_BASE       0x5F089000UL
#define NRF_SYSCTRL_HSFLL200_S_BASE       0xBF004000UL
#define NRF_SYSCTRL_LRCCONF200_S_BASE     0xBF005000UL
#define NRF_SYSCTRL_VPRCLIC_S_BASE        0x5F8C9000UL
#define NRF_SYSCTRL_L2CACHE_S_BASE        0x5F082000UL
#define NRF_SYSCTRL_RAMC110_S_BASE        0x5F083000UL
#define NRF_SYSCTRL_RAMC111_S_BASE        0x5F084000UL
#define NRF_SYSCTRL_SHA3_S_BASE           0x5F088000UL
#define NRF_SYSCTRL_PCGCS110_S_BASE       0x5F08E000UL
#define NRF_SYSCTRL_PCGCM110_S_BASE       0x5F08F000UL
#define NRF_SYSCTRL_EXMEE_S_BASE          0x5F094000UL
#define NRF_SYSCTRL_MVDMA_S_BASE          0x5F097000UL
#define NRF_SYSCTRL_PPIB110_S_BASE        0x5F098000UL
#define NRF_SYSCTRL_RAMC120_S_BASE        0x5F8C3000UL
#define NRF_SYSCTRL_RAMC121_S_BASE        0x5F8C4000UL
#define NRF_SYSCTRL_ROMC_S_BASE           0x5F8C6000UL
#define NRF_SYSCTRL_MEMCONF120_S_BASE     0x5F8C7000UL
#define NRF_SYSCTRL_HSFLL121_S_BASE       0x5F8CC000UL
#define NRF_SYSCTRL_HSFLL120_S_BASE       0x5F8CD000UL
#define NRF_SYSCTRL_LRCCONF120_S_BASE     0x5F8CE000UL
#define NRF_SYSCTRL_PCGCM120_S_BASE       0x5F8CF000UL
#define NRF_SYSCTRL_PCGCS120_S_BASE       0x5F8EA000UL
#define NRF_SYSCTRL_PCGCS121_S_BASE       0x5F8EB000UL
#define NRF_SYSCTRL_PCGCS122_S_BASE       0x5F8EC000UL
#define NRF_SYSCTRL_PCGCM121_S_BASE       0x5F8ED000UL
#define NRF_SYSCTRL_PPIB120_S_BASE        0x5F8EE000UL
#define NRF_SYSCTRL_PPIB121_S_BASE        0x5F8EF000UL
#define NRF_SYSCTRL_RAMC130_S_BASE        0x5F903000UL
#define NRF_SYSCTRL_RAMC131_S_BASE        0x5F904000UL
#define NRF_SYSCTRL_MEMCONF130_S_BASE     0x5F905000UL
#define NRF_SYSCTRL_PCGCS130_S_BASE       0x5F90E000UL
#define NRF_SYSCTRL_PPIB130_S_BASE        0x5F925000UL
#define NRF_SYSCTRL_PPIB131_S_BASE        0x5F926000UL
#define NRF_SYSCTRL_WDT130_S_BASE         0x5F92A000UL
#define NRF_SYSCTRL_PCGCS131_S_BASE       0x5F93C000UL
#define NRF_SYSCTRL_PCGCM130_S_BASE       0x5F93D000UL
#define NRF_SYSCTRL_LRCCONF130_S_BASE     0x5F93E000UL
#define NRF_SYSCTRL_PCGCM131_S_BASE       0x5F93F000UL
#define NRF_SYSCTRL_GRCCONF_S_BASE        0x5F940000UL
#define NRF_SYSCTRL_PCRM_S_BASE           0x5F943000UL
#define NRF_SYSCTRL_PCGCS132_S_BASE       0x5F94E000UL
#define NRF_SYSCTRL_PCGCM132_S_BASE       0x5F94F000UL
#define NRF_SYSCTRL_CLOCK_S_BASE          0x5F950000UL
#define NRF_SYSCTRL_LFRC_S_BASE           0x5F951000UL
#define NRF_SYSCTRL_GGENERIC18_S_BASE     0x5F952000UL
#define NRF_SYSCTRL_LFXO_S_BASE           0x5F953000UL
#define NRF_SYSCTRL_FLL16M_S_BASE         0x5F954000UL
#define NRF_SYSCTRL_HFXO_S_BASE           0x5F955000UL
#define NRF_SYSCTRL_AUDIOPLL_S_BASE       0x5F957000UL
#define NRF_SYSCTRL_USBHSPLL_S_BASE       0x5F958000UL
#define NRF_SYSCTRL_POWER_S_BASE          0x5F960000UL
#define NRF_SYSCTRL_VREGMAIN_S_BASE       0x5F961000UL
#define NRF_SYSCTRL_VREGAO1V8_S_BASE      0x5F962000UL
#define NRF_SYSCTRL_VREG1V0_S_BASE        0x5F963000UL
#define NRF_SYSCTRL_VREGAO0V8_S_BASE      0x5F964000UL
#define NRF_SYSCTRL_VREGVS0V8_S_BASE      0x5F965000UL
#define NRF_SYSCTRL_VREGSU_S_BASE         0x5F966000UL
#define NRF_SYSCTRL_VREGUSB_S_BASE        0x5F967000UL
#define NRF_SYSCTRL_AUDIOPLLPM_S_BASE     0x5F968000UL
#define NRF_SYSCTRL_VREGMRAM130_S_BASE    0x5F969000UL
#define NRF_SYSCTRL_VREGMRAM131_S_BASE    0x5F96A000UL
#define NRF_SYSCTRL_OSCRFR_S_BASE         0x5F96B000UL
#define NRF_SYSCTRL_SWEXT_S_BASE          0x5F96C000UL
#define NRF_SYSCTRL_MBIAS_S_BASE          0x5F96D000UL
#define NRF_SYSCTRL_VDETAO1V8_S_BASE      0x5F970000UL
#define NRF_SYSCTRL_VDETAO0V8_S_BASE      0x5F971000UL
#define NRF_SYSCTRL_VDETVS0V8_S_BASE      0x5F972000UL
#define NRF_SYSCTRL_VDETIO_S_BASE         0x5F974000UL
#define NRF_SYSCTRL_VDETAO5V0_S_BASE      0x5F975000UL
#define NRF_SYSCTRL_VDET1V0_S_BASE        0x5F976000UL
#define NRF_SYSCTRL_PPIB132_S_BASE        0x5F98D000UL
#define NRF_SYSCTRL_PCGCS133_S_BASE       0x5F98E000UL
#define NRF_SYSCTRL_PCGCM133_S_BASE       0x5F98F000UL
#define NRF_SYSCTRL_PPIB133_S_BASE        0x5F99D000UL
#define NRF_SYSCTRL_PCGCS134_S_BASE       0x5F99E000UL
#define NRF_SYSCTRL_PCGCM134_S_BASE       0x5F99F000UL
#define NRF_SYSCTRL_PPIB134_S_BASE        0x5F9AD000UL
#define NRF_SYSCTRL_PCGCS135_S_BASE       0x5F9AE000UL
#define NRF_SYSCTRL_PCGCM135_S_BASE       0x5F9AF000UL
#define NRF_SYSCTRL_PPIB135_S_BASE        0x5F9BD000UL
#define NRF_SYSCTRL_PCGCS136_S_BASE       0x5F9BE000UL
#define NRF_SYSCTRL_PCGCM136_S_BASE       0x5F9BF000UL
#define NRF_SYSCTRL_PPIB136_S_BASE        0x5F9CD000UL
#define NRF_SYSCTRL_PCGCS137_S_BASE       0x5F9CE000UL
#define NRF_SYSCTRL_PCGCM137_S_BASE       0x5F9CF000UL
#define NRF_SYSCTRL_PPIB137_S_BASE        0x5F9DD000UL
#define NRF_SYSCTRL_PCGCS138_S_BASE       0x5F9DE000UL
#define NRF_SYSCTRL_PCGCM138_S_BASE       0x5F9DF000UL

/* =========================================================================================================================== */
/* ================                                  Peripheral Declaration                                  ================ */
/* =========================================================================================================================== */

