adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.h
#define NRF_SYSCTRL_OICR_S                ((NRF_OICR_Type*)                     NRF_SYSCTRL_OICR_S_BASE)
#define NRF_SYSCTRL_L2CACHEDATA_S         ((NRF_CACHEDATA_Type*)                NRF_SYSCTRL_L2CACHEDATA_S_BASE)
#define NRF_SYSCTRL_L2CACHEINFO_S         ((NRF_CACHEINFO_Type*)                NRF_SYSCTRL_L2CACHEINFO_S_BASE)
#define NRF_SYSCTRL_SHA3CORE_S            ((NRF_CRACENCORE_Type*)               NRF_SYSCTRL_SHA3CORE_S_BASE)
#define NRF_SYSCTRL_HSFLL200_S            ((NRF_HSFLL_Type*)                    NRF_SYSCTRL_HSFLL200_S_BASE)
#define NRF_SYSCTRL_LRCCONF200_S          ((NRF_LRCCONF_Type*)                  NRF_SYSCTRL_LRCCONF200_S_BASE)
#define NRF_SYSCTRL_VPRCLIC_S             ((NRF_CLIC_Type*)                     NRF_SYSCTRL_VPRCLIC_S_BASE)
#define NRF_SYSCTRL_L2CACHE_S             ((NRF_CACHE_Type*)                    NRF_SYSCTRL_L2CACHE_S_BASE)
#define NRF_SYSCTRL_RAMC110_S             ((NRF_RAMC_Type*)                     NRF_SYSCTRL_RAMC110_S_BASE)
#define NRF_SYSCTRL_RAMC111_S             ((NRF_RAMC_Type*)                     NRF_SYSCTRL_RAMC111_S_BASE)
#define NRF_SYSCTRL_SHA3_S                ((NRF_CRACEN_Type*)                   NRF_SYSCTRL_SHA3_S_BASE)
#define NRF_SYSCTRL_PCGCS110_S            ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS110_S_BASE)
#define NRF_SYSCTRL_PCGCM110_S            ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM110_S_BASE)
#define NRF_SYSCTRL_EXMEE_S               ((NRF_EXMEE_Type*)                    NRF_SYSCTRL_EXMEE_S_BASE)
#define NRF_SYSCTRL_MVDMA_S               ((NRF_MVDMA_Type*)                    NRF_SYSCTRL_MVDMA_S_BASE)
#define NRF_SYSCTRL_PPIB110_S             ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB110_S_BASE)
#define NRF_SYSCTRL_RAMC120_S             ((NRF_RAMC_Type*)                     NRF_SYSCTRL_RAMC120_S_BASE)
#define NRF_SYSCTRL_RAMC121_S             ((NRF_RAMC_Type*)                     NRF_SYSCTRL_RAMC121_S_BASE)
#define NRF_SYSCTRL_ROMC_S                ((NRF_ROMC_Type*)                     NRF_SYSCTRL_ROMC_S_BASE)
#define NRF_SYSCTRL_MEMCONF120_S          ((NRF_MEMCONF_Type*)                  NRF_SYSCTRL_MEMCONF120_S_BASE)
#define NRF_SYSCTRL_HSFLL121_S            ((NRF_HSFLL_Type*)                    NRF_SYSCTRL_HSFLL121_S_BASE)
#define NRF_SYSCTRL_HSFLL120_S            ((NRF_HSFLL_Type*)                    NRF_SYSCTRL_HSFLL120_S_BASE)
#define NRF_SYSCTRL_LRCCONF120_S          ((NRF_LRCCONF_Type*)                  NRF_SYSCTRL_LRCCONF120_S_BASE)
#define NRF_SYSCTRL_PCGCM120_S            ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM120_S_BASE)
#define NRF_SYSCTRL_PCGCS120_S            ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS120_S_BASE)
#define NRF_SYSCTRL_PCGCS121_S            ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS121_S_BASE)
#define NRF_SYSCTRL_PCGCS122_S            ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS122_S_BASE)
#define NRF_SYSCTRL_PCGCM121_S            ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM121_S_BASE)
#define NRF_SYSCTRL_PPIB120_S             ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB120_S_BASE)
#define NRF_SYSCTRL_PPIB121_S             ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB121_S_BASE)
#define NRF_SYSCTRL_RAMC130_S             ((NRF_RAMC_Type*)                     NRF_SYSCTRL_RAMC130_S_BASE)
#define NRF_SYSCTRL_RAMC131_S             ((NRF_RAMC_Type*)                     NRF_SYSCTRL_RAMC131_S_BASE)
#define NRF_SYSCTRL_MEMCONF130_S          ((NRF_MEMCONF_Type*)                  NRF_SYSCTRL_MEMCONF130_S_BASE)
#define NRF_SYSCTRL_PCGCS130_S            ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS130_S_BASE)
#define NRF_SYSCTRL_PPIB130_S             ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB130_S_BASE)
#define NRF_SYSCTRL_PPIB131_S             ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB131_S_BASE)
#define NRF_SYSCTRL_WDT130_S              ((NRF_WDT_Type*)                      NRF_SYSCTRL_WDT130_S_BASE)
#define NRF_SYSCTRL_PCGCS131_S            ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS131_S_BASE)
#define NRF_SYSCTRL_PCGCM130_S            ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM130_S_BASE)
#define NRF_SYSCTRL_LRCCONF130_S          ((NRF_LRCCONF_Type*)                  NRF_SYSCTRL_LRCCONF130_S_BASE)
#define NRF_SYSCTRL_PCGCM131_S            ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM131_S_BASE)
#define NRF_SYSCTRL_GRCCONF_S             ((NRF_GRCCONF_Type*)                  NRF_SYSCTRL_GRCCONF_S_BASE)
#define NRF_SYSCTRL_PCRM_S                ((NRF_PCRM_Type*)                     NRF_SYSCTRL_PCRM_S_BASE)
#define NRF_SYSCTRL_PCGCS132_S            ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS132_S_BASE)
#define NRF_SYSCTRL_PCGCM132_S            ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM132_S_BASE)
#define NRF_SYSCTRL_CLOCK_S               ((NRF_CLOCK_Type*)                    NRF_SYSCTRL_CLOCK_S_BASE)
#define NRF_SYSCTRL_LFRC_S                ((NRF_LFRC_Type*)                     NRF_SYSCTRL_LFRC_S_BASE)
#define NRF_SYSCTRL_GGENERIC18_S          ((NRF_GENERIC_Type*)                  NRF_SYSCTRL_GGENERIC18_S_BASE)
#define NRF_SYSCTRL_LFXO_S                ((NRF_LFXO_Type*)                     NRF_SYSCTRL_LFXO_S_BASE)
#define NRF_SYSCTRL_FLL16M_S              ((NRF_FLL16M_Type*)                   NRF_SYSCTRL_FLL16M_S_BASE)
#define NRF_SYSCTRL_HFXO_S                ((NRF_HFXO_Type*)                     NRF_SYSCTRL_HFXO_S_BASE)
#define NRF_SYSCTRL_AUDIOPLL_S            ((NRF_AUXPLL_Type*)                   NRF_SYSCTRL_AUDIOPLL_S_BASE)
#define NRF_SYSCTRL_USBHSPLL_S            ((NRF_AUXPLL_Type*)                   NRF_SYSCTRL_USBHSPLL_S_BASE)
#define NRF_SYSCTRL_POWER_S               ((NRF_POWER_Type*)                    NRF_SYSCTRL_POWER_S_BASE)
#define NRF_SYSCTRL_VREGMAIN_S            ((NRF_VREGMAIN_Type*)                 NRF_SYSCTRL_VREGMAIN_S_BASE)
#define NRF_SYSCTRL_VREGAO1V8_S           ((NRF_VREGAO1V8_Type*)                NRF_SYSCTRL_VREGAO1V8_S_BASE)
#define NRF_SYSCTRL_VREG1V0_S             ((NRF_VREG1V0_Type*)                  NRF_SYSCTRL_VREG1V0_S_BASE)
#define NRF_SYSCTRL_VREGAO0V8_S           ((NRF_VREGAO0V8_Type*)                NRF_SYSCTRL_VREGAO0V8_S_BASE)
#define NRF_SYSCTRL_VREGVS0V8_S           ((NRF_VREGVS0V8_Type*)                NRF_SYSCTRL_VREGVS0V8_S_BASE)
#define NRF_SYSCTRL_VREGSU_S              ((NRF_VREGSU_Type*)                   NRF_SYSCTRL_VREGSU_S_BASE)
#define NRF_SYSCTRL_VREGUSB_S             ((NRF_VREGUSB_Type*)                  NRF_SYSCTRL_VREGUSB_S_BASE)
#define NRF_SYSCTRL_AUDIOPLLPM_S          ((NRF_AUXPM_Type*)                    NRF_SYSCTRL_AUDIOPLLPM_S_BASE)
#define NRF_SYSCTRL_VREGMRAM130_S         ((NRF_VREGMRAM_Type*)                 NRF_SYSCTRL_VREGMRAM130_S_BASE)
#define NRF_SYSCTRL_VREGMRAM131_S         ((NRF_VREGMRAM_Type*)                 NRF_SYSCTRL_VREGMRAM131_S_BASE)
#define NRF_SYSCTRL_OSCRFR_S              ((NRF_OSCRFR_Type*)                   NRF_SYSCTRL_OSCRFR_S_BASE)
#define NRF_SYSCTRL_SWEXT_S               ((NRF_SWEXT_Type*)                    NRF_SYSCTRL_SWEXT_S_BASE)
#define NRF_SYSCTRL_MBIAS_S               ((NRF_MBIAS_Type*)                    NRF_SYSCTRL_MBIAS_S_BASE)
#define NRF_SYSCTRL_VDETAO1V8_S           ((NRF_VDETAO1V8_Type*)                NRF_SYSCTRL_VDETAO1V8_S_BASE)
#define NRF_SYSCTRL_VDETAO0V8_S           ((NRF_VDETAO0V8_Type*)                NRF_SYSCTRL_VDETAO0V8_S_BASE)
#define NRF_SYSCTRL_VDETVS0V8_S           ((NRF_VDETVS0V8_Type*)                NRF_SYSCTRL_VDETVS0V8_S_BASE)
#define NRF_SYSCTRL_VDETIO_S              ((NRF_VDETIO_Type*)                   NRF_SYSCTRL_VDETIO_S_BASE)
#define NRF_SYSCTRL_VDETAO5V0_S           ((NRF_VDETAO5V0_Type*)                NRF_SYSCTRL_VDETAO5V0_S_BASE)
#define NRF_SYSCTRL_VDET1V0_S             ((NRF_VDET1V0_Type*)                  NRF_SYSCTRL_VDET1V0_S_BASE)
#define NRF_SYSCTRL_PPIB132_S             ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB132_S_BASE)
#define NRF_SYSCTRL_PCGCS133_S            ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS133_S_BASE)
#define NRF_SYSCTRL_PCGCM133_S            ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM133_S_BASE)
#define NRF_SYSCTRL_PPIB133_S             ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB133_S_BASE)
#define NRF_SYSCTRL_PCGCS134_S            ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS134_S_BASE)
#define NRF_SYSCTRL_PCGCM134_S            ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM134_S_BASE)
#define NRF_SYSCTRL_PPIB134_S             ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB134_S_BASE)
#define NRF_SYSCTRL_PCGCS135_S            ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS135_S_BASE)
#define NRF_SYSCTRL_PCGCM135_S            ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM135_S_BASE)
#define NRF_SYSCTRL_PPIB135_S             ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB135_S_BASE)
#define NRF_SYSCTRL_PCGCS136_S            ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS136_S_BASE)
#define NRF_SYSCTRL_PCGCM136_S            ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM136_S_BASE)
#define NRF_SYSCTRL_PPIB136_S             ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB136_S_BASE)
#define NRF_SYSCTRL_PCGCS137_S            ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS137_S_BASE)
#define NRF_SYSCTRL_PCGCM137_S            ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM137_S_BASE)
#define NRF_SYSCTRL_PPIB137_S             ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB137_S_BASE)
#define NRF_SYSCTRL_PCGCS138_S            ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS138_S_BASE)
#define NRF_SYSCTRL_PCGCM138_S            ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM138_S_BASE)

/* =========================================================================================================================== */
/* ================                                    TrustZone Remapping                                    ================ */
/* =========================================================================================================================== */

