adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.h
#ifdef NRF_TRUSTZONE_NONSECURE                       /*!< Remap NRF_X_NS instances to NRF_X symbol for ease of use.            */
#else                                                /*!< Remap NRF_X_S instances to NRF_X symbol for ease of use.             */
  #define NRF_SYSCTRL_OICR                        NRF_SYSCTRL_OICR_S
  #define NRF_SYSCTRL_L2CACHEDATA                 NRF_SYSCTRL_L2CACHEDATA_S
  #define NRF_SYSCTRL_L2CACHEINFO                 NRF_SYSCTRL_L2CACHEINFO_S
  #define NRF_SYSCTRL_SHA3CORE                    NRF_SYSCTRL_SHA3CORE_S
  #define NRF_SYSCTRL_HSFLL200                    NRF_SYSCTRL_HSFLL200_S
  #define NRF_SYSCTRL_LRCCONF200                  NRF_SYSCTRL_LRCCONF200_S
  #define NRF_SYSCTRL_VPRCLIC                     NRF_SYSCTRL_VPRCLIC_S
  #define NRF_SYSCTRL_L2CACHE                     NRF_SYSCTRL_L2CACHE_S
  #define NRF_SYSCTRL_RAMC110                     NRF_SYSCTRL_RAMC110_S
  #define NRF_SYSCTRL_RAMC111                     NRF_SYSCTRL_RAMC111_S
  #define NRF_SYSCTRL_SHA3                        NRF_SYSCTRL_SHA3_S
  #define NRF_SYSCTRL_PCGCS110                    NRF_SYSCTRL_PCGCS110_S
  #define NRF_SYSCTRL_PCGCM110                    NRF_SYSCTRL_PCGCM110_S
  #define NRF_SYSCTRL_EXMEE                       NRF_SYSCTRL_EXMEE_S
  #define NRF_SYSCTRL_MVDMA                       NRF_SYSCTRL_MVDMA_S
  #define NRF_SYSCTRL_PPIB110                     NRF_SYSCTRL_PPIB110_S
  #define NRF_SYSCTRL_RAMC120                     NRF_SYSCTRL_RAMC120_S
  #define NRF_SYSCTRL_RAMC121                     NRF_SYSCTRL_RAMC121_S
  #define NRF_SYSCTRL_ROMC                        NRF_SYSCTRL_ROMC_S
  #define NRF_SYSCTRL_MEMCONF120                  NRF_SYSCTRL_MEMCONF120_S
  #define NRF_SYSCTRL_HSFLL121                    NRF_SYSCTRL_HSFLL121_S
  #define NRF_SYSCTRL_HSFLL120                    NRF_SYSCTRL_HSFLL120_S
  #define NRF_SYSCTRL_LRCCONF120                  NRF_SYSCTRL_LRCCONF120_S
  #define NRF_SYSCTRL_PCGCM120                    NRF_SYSCTRL_PCGCM120_S
  #define NRF_SYSCTRL_PCGCS120                    NRF_SYSCTRL_PCGCS120_S
  #define NRF_SYSCTRL_PCGCS121                    NRF_SYSCTRL_PCGCS121_S
  #define NRF_SYSCTRL_PCGCS122                    NRF_SYSCTRL_PCGCS122_S
  #define NRF_SYSCTRL_PCGCM121                    NRF_SYSCTRL_PCGCM121_S
  #define NRF_SYSCTRL_PPIB120                     NRF_SYSCTRL_PPIB120_S
  #define NRF_SYSCTRL_PPIB121                     NRF_SYSCTRL_PPIB121_S
  #define NRF_SYSCTRL_RAMC130                     NRF_SYSCTRL_RAMC130_S
  #define NRF_SYSCTRL_RAMC131                     NRF_SYSCTRL_RAMC131_S
  #define NRF_SYSCTRL_MEMCONF130                  NRF_SYSCTRL_MEMCONF130_S
  #define NRF_SYSCTRL_PCGCS130                    NRF_SYSCTRL_PCGCS130_S
  #define NRF_SYSCTRL_PPIB130                     NRF_SYSCTRL_PPIB130_S
  #define NRF_SYSCTRL_PPIB131                     NRF_SYSCTRL_PPIB131_S
  #define NRF_SYSCTRL_WDT130                      NRF_SYSCTRL_WDT130_S
  #define NRF_SYSCTRL_PCGCS131                    NRF_SYSCTRL_PCGCS131_S
  #define NRF_SYSCTRL_PCGCM130                    NRF_SYSCTRL_PCGCM130_S
  #define NRF_SYSCTRL_LRCCONF130                  NRF_SYSCTRL_LRCCONF130_S
  #define NRF_SYSCTRL_PCGCM131                    NRF_SYSCTRL_PCGCM131_S
  #define NRF_SYSCTRL_GRCCONF                     NRF_SYSCTRL_GRCCONF_S
  #define NRF_SYSCTRL_PCRM                        NRF_SYSCTRL_PCRM_S
  #define NRF_SYSCTRL_PCGCS132                    NRF_SYSCTRL_PCGCS132_S
  #define NRF_SYSCTRL_PCGCM132                    NRF_SYSCTRL_PCGCM132_S
  #define NRF_SYSCTRL_CLOCK                       NRF_SYSCTRL_CLOCK_S
  #define NRF_SYSCTRL_LFRC                        NRF_SYSCTRL_LFRC_S
  #define NRF_SYSCTRL_GGENERIC18                  NRF_SYSCTRL_GGENERIC18_S
  #define NRF_SYSCTRL_LFXO                        NRF_SYSCTRL_LFXO_S
  #define NRF_SYSCTRL_FLL16M                      NRF_SYSCTRL_FLL16M_S
  #define NRF_SYSCTRL_HFXO                        NRF_SYSCTRL_HFXO_S
  #define NRF_SYSCTRL_AUDIOPLL                    NRF_SYSCTRL_AUDIOPLL_S
  #define NRF_SYSCTRL_USBHSPLL                    NRF_SYSCTRL_USBHSPLL_S
  #define NRF_SYSCTRL_POWER                       NRF_SYSCTRL_POWER_S
  #define NRF_SYSCTRL_VREGMAIN                    NRF_SYSCTRL_VREGMAIN_S
  #define NRF_SYSCTRL_VREGAO1V8                   NRF_SYSCTRL_VREGAO1V8_S
  #define NRF_SYSCTRL_VREG1V0                     NRF_SYSCTRL_VREG1V0_S
  #define NRF_SYSCTRL_VREGAO0V8                   NRF_SYSCTRL_VREGAO0V8_S
  #define NRF_SYSCTRL_VREGVS0V8                   NRF_SYSCTRL_VREGVS0V8_S
  #define NRF_SYSCTRL_VREGSU                      NRF_SYSCTRL_VREGSU_S
  #define NRF_SYSCTRL_VREGUSB                     NRF_SYSCTRL_VREGUSB_S
  #define NRF_SYSCTRL_AUDIOPLLPM                  NRF_SYSCTRL_AUDIOPLLPM_S
  #define NRF_SYSCTRL_VREGMRAM130                 NRF_SYSCTRL_VREGMRAM130_S
  #define NRF_SYSCTRL_VREGMRAM131                 NRF_SYSCTRL_VREGMRAM131_S
  #define NRF_SYSCTRL_OSCRFR                      NRF_SYSCTRL_OSCRFR_S
  #define NRF_SYSCTRL_SWEXT                       NRF_SYSCTRL_SWEXT_S
  #define NRF_SYSCTRL_MBIAS                       NRF_SYSCTRL_MBIAS_S
  #define NRF_SYSCTRL_VDETAO1V8                   NRF_SYSCTRL_VDETAO1V8_S
  #define NRF_SYSCTRL_VDETAO0V8                   NRF_SYSCTRL_VDETAO0V8_S
  #define NRF_SYSCTRL_VDETVS0V8                   NRF_SYSCTRL_VDETVS0V8_S
  #define NRF_SYSCTRL_VDETIO                      NRF_SYSCTRL_VDETIO_S
  #define NRF_SYSCTRL_VDETAO5V0                   NRF_SYSCTRL_VDETAO5V0_S
  #define NRF_SYSCTRL_VDET1V0                     NRF_SYSCTRL_VDET1V0_S
  #define NRF_SYSCTRL_PPIB132                     NRF_SYSCTRL_PPIB132_S
  #define NRF_SYSCTRL_PCGCS133                    NRF_SYSCTRL_PCGCS133_S
  #define NRF_SYSCTRL_PCGCM133                    NRF_SYSCTRL_PCGCM133_S
  #define NRF_SYSCTRL_PPIB133                     NRF_SYSCTRL_PPIB133_S
  #define NRF_SYSCTRL_PCGCS134                    NRF_SYSCTRL_PCGCS134_S
  #define NRF_SYSCTRL_PCGCM134                    NRF_SYSCTRL_PCGCM134_S
  #define NRF_SYSCTRL_PPIB134                     NRF_SYSCTRL_PPIB134_S
  #define NRF_SYSCTRL_PCGCS135                    NRF_SYSCTRL_PCGCS135_S
  #define NRF_SYSCTRL_PCGCM135                    NRF_SYSCTRL_PCGCM135_S
  #define NRF_SYSCTRL_PPIB135                     NRF_SYSCTRL_PPIB135_S
  #define NRF_SYSCTRL_PCGCS136                    NRF_SYSCTRL_PCGCS136_S
  #define NRF_SYSCTRL_PCGCM136                    NRF_SYSCTRL_PCGCM136_S
  #define NRF_SYSCTRL_PPIB136                     NRF_SYSCTRL_PPIB136_S
  #define NRF_SYSCTRL_PCGCS137                    NRF_SYSCTRL_PCGCS137_S
  #define NRF_SYSCTRL_PCGCM137                    NRF_SYSCTRL_PCGCM137_S
  #define NRF_SYSCTRL_PPIB137                     NRF_SYSCTRL_PPIB137_S
  #define NRF_SYSCTRL_PCGCS138                    NRF_SYSCTRL_PCGCS138_S
  #define NRF_SYSCTRL_PCGCM138                    NRF_SYSCTRL_PCGCM138_S
#endif                                               /*!<  NRF_TRUSTZONE_NONSECURE                                             */

/* =========================================================================================================================== */
/* ================                                  Local Domain Remapping                                  ================ */
/* =========================================================================================================================== */

#ifdef NRF_SYSCTRL                                   /*!< Remap NRF_DOMAIN instances to NRF_X symbol for ease of use.          */
  #define NRF_OICR                                NRF_SYSCTRL_OICR
  #define NRF_L2CACHEDATA                         NRF_SYSCTRL_L2CACHEDATA
  #define NRF_L2CACHEINFO                         NRF_SYSCTRL_L2CACHEINFO
  #define NRF_SHA3CORE                            NRF_SYSCTRL_SHA3CORE
  #define NRF_HSFLL200                            NRF_SYSCTRL_HSFLL200
  #define NRF_LRCCONF200                          NRF_SYSCTRL_LRCCONF200
  #define NRF_VPRCLIC                             NRF_SYSCTRL_VPRCLIC
  #define NRF_L2CACHE                             NRF_SYSCTRL_L2CACHE
  #define NRF_RAMC110                             NRF_SYSCTRL_RAMC110
  #define NRF_RAMC111                             NRF_SYSCTRL_RAMC111
  #define NRF_SHA3                                NRF_SYSCTRL_SHA3
  #define NRF_PCGCS110                            NRF_SYSCTRL_PCGCS110
  #define NRF_PCGCM110                            NRF_SYSCTRL_PCGCM110
  #define NRF_EXMEE                               NRF_SYSCTRL_EXMEE
  #define NRF_MVDMA                               NRF_SYSCTRL_MVDMA
  #define NRF_PPIB110                             NRF_SYSCTRL_PPIB110
  #define NRF_RAMC120                             NRF_SYSCTRL_RAMC120
  #define NRF_RAMC121                             NRF_SYSCTRL_RAMC121
  #define NRF_ROMC                                NRF_SYSCTRL_ROMC
  #define NRF_MEMCONF120                          NRF_SYSCTRL_MEMCONF120
  #define NRF_HSFLL121                            NRF_SYSCTRL_HSFLL121
  #define NRF_HSFLL120                            NRF_SYSCTRL_HSFLL120
  #define NRF_LRCCONF120                          NRF_SYSCTRL_LRCCONF120
  #define NRF_PCGCM120                            NRF_SYSCTRL_PCGCM120
  #define NRF_PCGCS120                            NRF_SYSCTRL_PCGCS120
  #define NRF_PCGCS121                            NRF_SYSCTRL_PCGCS121
  #define NRF_PCGCS122                            NRF_SYSCTRL_PCGCS122
  #define NRF_PCGCM121                            NRF_SYSCTRL_PCGCM121
  #define NRF_PPIB120                             NRF_SYSCTRL_PPIB120
  #define NRF_PPIB121                             NRF_SYSCTRL_PPIB121
  #define NRF_RAMC130                             NRF_SYSCTRL_RAMC130
  #define NRF_RAMC131                             NRF_SYSCTRL_RAMC131
  #define NRF_MEMCONF130                          NRF_SYSCTRL_MEMCONF130
  #define NRF_PCGCS130                            NRF_SYSCTRL_PCGCS130
  #define NRF_PPIB130                             NRF_SYSCTRL_PPIB130
  #define NRF_PPIB131                             NRF_SYSCTRL_PPIB131
  #define NRF_WDT130                              NRF_SYSCTRL_WDT130
  #define NRF_PCGCS131                            NRF_SYSCTRL_PCGCS131
  #define NRF_PCGCM130                            NRF_SYSCTRL_PCGCM130
  #define NRF_LRCCONF130                          NRF_SYSCTRL_LRCCONF130
  #define NRF_PCGCM131                            NRF_SYSCTRL_PCGCM131
  #define NRF_GRCCONF                             NRF_SYSCTRL_GRCCONF
  #define NRF_PCRM                                NRF_SYSCTRL_PCRM
  #define NRF_PCGCS132                            NRF_SYSCTRL_PCGCS132
  #define NRF_PCGCM132                            NRF_SYSCTRL_PCGCM132
  #define NRF_CLOCK                               NRF_SYSCTRL_CLOCK
  #define NRF_LFRC                                NRF_SYSCTRL_LFRC
  #define NRF_GGENERIC18                          NRF_SYSCTRL_GGENERIC18
  #define NRF_LFXO                                NRF_SYSCTRL_LFXO
  #define NRF_FLL16M                              NRF_SYSCTRL_FLL16M
  #define NRF_HFXO                                NRF_SYSCTRL_HFXO
  #define NRF_AUDIOPLL                            NRF_SYSCTRL_AUDIOPLL
  #define NRF_USBHSPLL                            NRF_SYSCTRL_USBHSPLL
  #define NRF_POWER                               NRF_SYSCTRL_POWER
  #define NRF_VREGMAIN                            NRF_SYSCTRL_VREGMAIN
  #define NRF_VREGAO1V8                           NRF_SYSCTRL_VREGAO1V8
  #define NRF_VREG1V0                             NRF_SYSCTRL_VREG1V0
  #define NRF_VREGAO0V8                           NRF_SYSCTRL_VREGAO0V8
  #define NRF_VREGVS0V8                           NRF_SYSCTRL_VREGVS0V8
  #define NRF_VREGSU                              NRF_SYSCTRL_VREGSU
  #define NRF_VREGUSB                             NRF_SYSCTRL_VREGUSB
  #define NRF_AUDIOPLLPM                          NRF_SYSCTRL_AUDIOPLLPM
  #define NRF_VREGMRAM130                         NRF_SYSCTRL_VREGMRAM130
  #define NRF_VREGMRAM131                         NRF_SYSCTRL_VREGMRAM131
  #define NRF_OSCRFR                              NRF_SYSCTRL_OSCRFR
  #define NRF_SWEXT                               NRF_SYSCTRL_SWEXT
  #define NRF_MBIAS                               NRF_SYSCTRL_MBIAS
  #define NRF_VDETAO1V8                           NRF_SYSCTRL_VDETAO1V8
  #define NRF_VDETAO0V8                           NRF_SYSCTRL_VDETAO0V8
  #define NRF_VDETVS0V8                           NRF_SYSCTRL_VDETVS0V8
  #define NRF_VDETIO                              NRF_SYSCTRL_VDETIO
  #define NRF_VDETAO5V0                           NRF_SYSCTRL_VDETAO5V0
  #define NRF_VDET1V0                             NRF_SYSCTRL_VDET1V0
  #define NRF_PPIB132                             NRF_SYSCTRL_PPIB132
  #define NRF_PCGCS133                            NRF_SYSCTRL_PCGCS133
  #define NRF_PCGCM133                            NRF_SYSCTRL_PCGCM133
  #define NRF_PPIB133                             NRF_SYSCTRL_PPIB133
  #define NRF_PCGCS134                            NRF_SYSCTRL_PCGCS134
  #define NRF_PCGCM134                            NRF_SYSCTRL_PCGCM134
  #define NRF_PPIB134                             NRF_SYSCTRL_PPIB134
  #define NRF_PCGCS135                            NRF_SYSCTRL_PCGCS135
  #define NRF_PCGCM135                            NRF_SYSCTRL_PCGCM135
  #define NRF_PPIB135                             NRF_SYSCTRL_PPIB135
  #define NRF_PCGCS136                            NRF_SYSCTRL_PCGCS136
  #define NRF_PCGCM136                            NRF_SYSCTRL_PCGCM136
  #define NRF_PPIB136                             NRF_SYSCTRL_PPIB136
  #define NRF_PCGCS137                            NRF_SYSCTRL_PCGCS137
  #define NRF_PCGCM137                            NRF_SYSCTRL_PCGCM137
  #define NRF_PPIB137                             NRF_SYSCTRL_PPIB137
  #define NRF_PCGCS138                            NRF_SYSCTRL_PCGCS138
  #define NRF_PCGCM138                            NRF_SYSCTRL_PCGCM138
#endif                                               /*!< NRF_SYSCTRL                                                          */

/* ========================================== End of section using anonymous unions ========================================== */

#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif
#endif /* NRF54H20_ENGA_SYSCTRL_H */

